{"class_name": "Model", "keras_version": "2.1.6-tf", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, 257], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "CuDNNLSTM", "config": {"recurrent_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "cu_dnnlstm", "kernel_constraint": null, "bias_regularizer": null, "return_state": false, "dtype": "float32", "activity_regularizer": null, "trainable": true, "stateful": false, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "go_backwards": false, "units": 500, "return_sequences": false, "batch_input_shape": [null, null, 257], "recurrent_constraint": null, "unit_forget_bias": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "cu_dnnlstm"}, {"class_name": "RepeatVector", "config": {"dtype": "float32", "trainable": true, "name": "repeat_vector", "n": 20}, "inbound_nodes": [[["cu_dnnlstm", 0, 0, {}]]], "name": "repeat_vector"}, {"class_name": "CuDNNLSTM", "config": {"recurrent_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "cu_dnnlstm_1", "kernel_constraint": null, "bias_regularizer": null, "return_state": false, "dtype": "float32", "activity_regularizer": null, "trainable": true, "stateful": false, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "go_backwards": false, "units": 500, "return_sequences": true, "unit_forget_bias": true, "recurrent_constraint": null}, "inbound_nodes": [[["repeat_vector", 0, 0, {}]]], "name": "cu_dnnlstm_1"}, {"class_name": "TimeDistributed", "config": {"dtype": "float32", "layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "dense", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 257, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed"}, "inbound_nodes": [[["cu_dnnlstm_1", 0, 0, {}]]], "name": "time_distributed"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply"}, "inbound_nodes": [[["input_1", 0, 0, {}], ["time_distributed", 0, 0, {}]]], "name": "multiply"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["multiply", 0, 0]], "name": "model"}, "backend": "tensorflow"}